{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 3, 1792], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "reshape_6", "class_name": "Reshape", "config": {"name": "reshape_6", "trainable": true, "batch_input_shape": [null, 3, 3, 1792], "dtype": "float32", "target_shape": [16128]}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "dense_26", "class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "batch_input_shape": [null, 16128], "dtype": "float32", "units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_6", 0, 0, {}]]]}, {"name": "dense_27", "class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_26", 0, 0, {}]]]}, {"name": "dense_28", "class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_27", 0, 0, {}]]]}, {"name": "dense_29", "class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "units": 200, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_28", 0, 0, {}]]]}, {"name": "dense_30", "class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_29", 0, 0, {}]]]}], "input_layers": [["input_6", 0, 0]], "output_layers": [["dense_30", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}